glm-disagg/results/concurrency/2ptp1_1dtp2/result_mc28.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-disagg
  Decode pod:   ms-glm-disagg-llm-d-modelservice-decode-69b7d6b664-5xcvp
  Decode log:   results/2ptp1_1dtp2/decode_mc28.log
  Prefill pod:  ms-glm-disagg-llm-d-modelservice-prefill-54577d8455-g87w6
  Prefill log:  results/2ptp1_1dtp2/prefill_mc28.log
  Prefill IPs:  10.244.3.178 10.244.2.65  (metrics port: 8000)

Starting decode pod log capture to results/2ptp1_1dtp2/decode_mc28.log ...
Starting prefill pod log capture to results/2ptp1_1dtp2/prefill_mc28.log ...

==============================================
Running Concurrency Sweep (timeout: 900s)
  Target: glm-disagg | Max Concurrency: 28
==============================================
SWEEP_START
CONFIG: target=glm-disagg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=4
TARGET_DURATION: 120s  MIN_PROMPTS: 200
CONCURRENCY_LEVELS: 28

CALIBRATION: concurrency=28 num_prompts=28
vllm bench serve --base-url $(just _url glm-disagg) --model $(just _model glm-disagg) --dataset-name random --random-input-len 4096 --random-output-len 256 --max-concurrency 28 --request-rate 4096 --seed $(date +%M%H%M%S) --num-prompts 28 --ignore-eos
#!/usr/bin/env bash
URL=$(just _url glm-disagg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-disagg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
INFO 02-27 00:52:15 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 00:52:15 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 00:52:15 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 00:52:18 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f979230eca0>, seed=52005212, num_prompts=28, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-disagg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=28, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-c938b70e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 00:52:19 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/28 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 28
100%|██████████| 28/28 [00:18<00:00,  1.48it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     28        
Failed requests:                         0         
Maximum request concurrency:             28        
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  18.89     
Total input tokens:                      114660    
Total generated tokens:                  7168      
Request throughput (req/s):              1.48      
Output token throughput (tok/s):         379.52    
Peak output token throughput (tok/s):    597.00    
Peak concurrent requests:                28.00     
Total token throughput (tok/s):          6450.43   
---------------Time to First Token----------------
Mean TTFT (ms):                          7292.83   
Median TTFT (ms):                        7288.20   
P99 TTFT (ms):                           13470.98  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.69     
Median TPOT (ms):                        23.14     
P99 TPOT (ms):                           23.42     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.69     
Median ITL (ms):                         22.89     
P99 ITL (ms):                            29.66     
==================================================
COMPUTED_NUM_PROMPTS: 200 (throughput=6450.43 tok/s, timeout=300s)

==============================================
Snapshotting Prometheus metrics (pre-benchmark)
==============================================
  queue_time:   sum=545.472634  count=1733
  prefill_time: sum=2789.714388  count=1733

BENCH_RUN: concurrency=28 num_prompts=200 timeout=300s
vllm bench serve --base-url $(just _url glm-disagg) --model $(just _model glm-disagg) --dataset-name random --random-input-len 4096 --random-output-len 256 --max-concurrency 28 --request-rate 4096 --seed $(date +%M%H%M%S) --num-prompts 200 --ignore-eos
#!/usr/bin/env bash
URL=$(just _url glm-disagg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-disagg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
INFO 02-27 00:52:44 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 00:52:44 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 00:52:44 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 00:52:46 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f328adeaca0>, seed=52005241, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-disagg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=28, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-d967c395-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 00:52:48 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/200 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 28
100%|██████████| 200/200 [01:35<00:00,  2.10it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Maximum request concurrency:             28        
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  95.39     
Total input tokens:                      819000    
Total generated tokens:                  51200     
Request throughput (req/s):              2.10      
Output token throughput (tok/s):         536.74    
Peak output token throughput (tok/s):    631.00    
Peak concurrent requests:                32.00     
Total token throughput (tok/s):          9122.41   
---------------Time to First Token----------------
Mean TTFT (ms):                          6585.40   
Median TTFT (ms):                        6450.77   
P99 TTFT (ms):                           13469.94  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.44     
Median TPOT (ms):                        23.51     
P99 TPOT (ms):                           23.73     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.44     
Median ITL (ms):                         23.47     
P99 ITL (ms):                            30.05     
==================================================
BENCH_RUN_END: concurrency=28

==============================================
Sweep Completed (exit 0)
==============================================
SWEEP_END

==============================================
Snapshotting Prometheus metrics (post-benchmark)
==============================================
  queue_time:   sum=996.988717  count=1933
  prefill_time: sum=3459.449262  count=1933

==============================================
Prometheus Metrics Summary (concurrency=28)
==============================================
PROMETHEUS_METRICS: concurrency=28
  request_queue_time:   avg = 2.257580 s  (sum_delta=451.5161, count_delta=200)
  request_prefill_time: avg = 3.348674 s  (sum_delta=669.7349, count_delta=200)

Stopping log captures...
Decode log:  results/2ptp1_1dtp2/decode_mc28.log (26 lines, 8.0K)
Prefill log: results/2ptp1_1dtp2/prefill_mc28.log (130 lines, 24K)